# Data Cleaning Assignment

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Problem 1

In [6]:
df['FlightNumberNan']=df['FlightNumber'].isnull()

In [7]:
for i in range(0,df.shape[0]):
    if(df['FlightNumberNan'][i]==True):
        df['FlightNumber'][i]=df['FlightNumber'][i-1]+10

<ipython-input-7-89c92affd689>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10

In [8]:
df

,From_To,FlightNumber,RecentDelays,Airline,FlightNumberNan
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),False
1,MAdrid_miLAN,10055.0,[],<Air France> (12),True
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),False
3,Budapest_PaRis,10075.0,[13],12. Air France,True
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",False

## Problem 2

In [9]:
items=(df.From_To).str.split('_')
items.columns=['From','To']
items
lis1=list()
lis2=list()
for i in range(0,df.shape[0]):
    lis1.append(items[i][0])
    lis2.append(items[i][1])

In [10]:
df['From']=lis1
df['To']=lis2
df

,From_To,FlightNumber,RecentDelays,Airline,FlightNumberNan,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),False,LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),True,MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),False,londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,True,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",False,Brussels,londOn

## Problem 3

In [11]:
df.From=df.From.str.capitalize()
df.To=df.To.str.capitalize()

In [12]:
df

,From_To,FlightNumber,RecentDelays,Airline,FlightNumberNan,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),False,London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),True,Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),False,London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,True,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",False,Brussels,London

## Problem 4

In [13]:
df=df.drop('From_To',axis=1)

In [14]:
df

,FlightNumber,RecentDelays,Airline,FlightNumberNan,From,To
0,10045.0,"[23, 47]",KLM(!),False,London,Paris
1,10055.0,[],<Air France> (12),True,Madrid,Milan
2,10065.0,"[24, 43, 87]",(British Airways. ),False,London,Stockholm
3,10075.0,[13],12. Air France,True,Budapest,Paris
4,10085.0,"[67, 32]","""Swiss Air""",False,Brussels,London

## Problem 5

In [15]:
delays=pd.DataFrame(df['RecentDelays'].values.tolist())

In [16]:
delays=delays.rename(columns={0:"delays_1",1:"delays_2",2:"delays_3"})

In [17]:
df=df.drop('RecentDelays',axis=1).join(delays)

In [18]:
df

,FlightNumber,Airline,FlightNumberNan,From,To,delays_1,delays_2,delays_3
0,10045.0,KLM(!),False,London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),True,Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),False,London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,True,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",False,Brussels,London,67.0,32.0,NaN